In [45]:
# Standard imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Importing sqlalchemy and pymysql
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from sqlalchemy.types import *
import pymysql
pymysql.install_as_MySQLdb()

In [46]:
# importing title_basics data
basics = pd.read_csv(r'Data\basics_title.csv.gz')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama

In [47]:
# import title_ratings data
ratings = pd.read_csv(r'Data\ratings_title.csv.gz')
ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262

In [48]:
# importing both years 2000 and 2001 datasets from TMDB
tmdb_2000 = pd.read_csv(r'Data\final_tmdb_data_2000.csv.gz')
tmdb_2001 = pd.read_csv(r'Data\final_tmdb_data_2001.csv.gz')
# concatenating both years into one dataframe
tmdb_df = pd.concat([tmdb_2000, tmdb_2001], axis=0)
# displaying the first two rows
tmdb_df.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

In [49]:
# Splitting the genres column into a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]

In [50]:
# Exploding the genres column into a new dataframe
basics_exploded = basics.explode('genres_split')
basics_exploded.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy

In [51]:
# Assigning unique_genres to a list of unique genres sorted alphabetically
unique_genres = sorted(basics_exploded['genres_split'].unique())
# Creating a new dataframe with the unique genres as columns and the tconst as index
title_genres = basics_exploded[['tconst', 'genres_split']].copy()
# Displaying the first four rows
title_genres.head(4)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama

In [52]:
# Creating a dictionary with the unique genres as keys and a list of tconst as values
genre_ints = range(len(unique_genres))
# Using the zip function to create a dictionary with the unique genres as keys and a list of tconst as values
genre_map = dict(zip(unique_genres, genre_ints))
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))

In [53]:
## Making new interger genre_id and dropping the genres_split column
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
# Dropping the genres_split column
title_genres = title_genres.drop(columns=['genres_split'])
# Creating genre_lookup dataframe to map genre_id to genre
genre_lookup = pd.DataFrame({'genre_id': genre_id_map.values(), 'genre': genre_id_map.keys()})
# Displaying the first four rows
genre_lookup.head(4)

   genre_id      genre
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation

In [54]:
# Dropping multiple unnecessary columns from the basics dataframe
basics = basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'])
basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70

In [55]:
## Creating connection to MySQL database
# Creating a database engine that connects to the MySQL server running on localhost
engine = create_engine('mysql+pymysql://root:root@localhost:3306/movies')

In [56]:
## Checking if the database exists
if not database_exists(engine.url):
    # If the database does not exist, create it
    create_database(engine.url)
    # Print a message to the user
    print(f'Database created at {engine.url}')
else:
    # If the database already exists, print a message to the user
    print(f'Database already exists at {engine.url}')

Database already exists at mysql+pymysql://root:root@localhost:3306/movies

In [57]:
## Caluculating the max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
# Filling null values with empty strings and calculating the max string length
title_len = basics['primaryTitle'].fillna('').map(len).max()

## Creating the schema for the title_basics table
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'endYear': Float(),
    'runtimeMinutes': Integer()
}

In [58]:
# Creating the table in the MySQL database
basics.to_sql('title_basics', engine, dtype=basics_schema, if_exists='replace', index=False)
# Adding a primary key to the table 
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (tconst);')

In [59]:
# Checking if the table exists in the database
q = 'SELECT * FROM title_basics LIMIT 5;'
# Using pandas to read the query into a dataframe
pd.read_sql_query(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [60]:
# Calculating the max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
# Creating the schema for the title_ratings table
ratings_schema = {
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'numVotes': Integer()
}

In [61]:
# Creating a new table in the MySQL database
ratings.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists='replace', index=False)
# Adding a primary key to the table
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (tconst);')

In [62]:
# Checking if the table exists in the database
q = 'SELECT * FROM title_ratings LIMIT 5;'
# Using pandas to read the query into a dataframe
pd.read_sql_query(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262
2  tt0000005            6.2      2603
3  tt0000006            5.1       178
4  tt0000007            5.4       816

In [64]:
# Creating a new dataframe from tmdb_df with only the columns we need
tmdb_data = tmdb_df[['imdb_id', 'budget', 'revenue', 'certification']].copy()
# Resetting the index 
tmdb_data = tmdb_data.reset_index()
# Dropping the old index column 
tmdb_data = tmdb_data.drop(columns=['index'])
# Checking the dataframe to see if the columns are correct
tmdb_data.head(4)

     imdb_id      budget  revenue certification
0          0         NaN      NaN           NaN
1  tt0113026  10000000.0      0.0           NaN
2  tt0113092         0.0      0.0           NaN
3  tt0116391         0.0      0.0           NaN

In [65]:
# Calculating the max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

# Creating the schema for the tmdb_data table
tmdb_schema = {
    'imdb_id':String(key_len+1),
    'budget': Integer(),
    'revenue': Integer(),
    'certification': String(cert_len+1)
}

In [66]:
# Adding a new table to the MySQL database
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=False)

2542

In [68]:
# Checking if the table exists in the database
q = 'SELECT * FROM tmdb_data LIMIT 5;'
# Using pandas to read the query into a dataframe
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694    150000.0  12854953.0            PG

In [69]:
# Adding table to MySQL database
genre_lookup.to_sql('genres', engine, if_exists='replace', index=False)
# Adding a primary key to table genres
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (genre_id);')

In [70]:
# Checking if the table exists in the database
q = 'SELECT * FROM genres LIMIT 5;'
# Using pandas to read the query into a dataframe
pd.read_sql(q, engine)

   genre_id      genre
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [71]:
# Adding table to MySQL database
title_genres.to_sql('title_genres', engine, if_exists='replace', index=False)

161094

In [72]:
# Checking the table exists in the database
q = 'SELECT * FROM title_genres LIMIT 5;'
# Using pandas to read the query into a dataframe
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [73]:
# Showing all the tables in the database
q = 'SHOW TABLES;'
# Using pandas to read the query into a dataframe
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data